
/**
  # Интерфейс 3D модели
 **/
namespace model {

  
  /**
  ## Переключатели.
  **/
  enum class sw : unsigned short {
    
    /**
    ### Контроллер машиниста
    Type: Мультипереключатель
    Name: kontrol
    Flags: CONTROLLERX
    **/
    kontrol_0 = 0,

    /**
    ### Реверсивная рукоятка
    Type: Мультипереключатель
    Name: revers
    Flags: CONTROLLERY, KEY
    **/
    revers_1 = 1,

    /**
    ### Редуктор зарядного давления ТМ
    Type: Мультипереключатель
    Name: reduk
    Flags: CONTROLLERX
    **/
    reduk_2 = 2,

    /**
    ### Комбинированный кран
    Type: Мультипереключатель
    Name: kdt
    Flags: CONTROLLERX
    **/
    kdt_3 = 3,

    /**
    ### Ключ БУ 367
    Type: Выключатель/тумблер
    Name: block
    Flags: CONTROLLERX, KEY
    **/
    block_4 = 4,

    /**
    ### Тормоз локомотива усл. 254
    Type: Мультипереключатель
    Name: 
    Flags: CONTROLLERX
    **/
    _254_5 = 5,

    /**
    ### Тормоз поезда усл. 394
    Type: Мультипереключатель
    Name: 
    Flags: CONTROLLERX
    **/
    _394_6 = 6,

    /**
    ### Топливный насос 1
    Type: Выключатель/тумблер
    Name: tn1
    Flags: 
    **/
    tn1_7 = 7,

    /**
    ### Топливный насос 2
    Type: Выключатель/тумблер
    Name: tn2
    Flags: 
    **/
    tn2_8 = 8,

    /**
    ### Управление тепловозом
    Type: Выключатель/тумблер
    Name: ut
    Flags: 
    **/
    ut_9 = 9,

    /**
    ### Движение
    Type: Выключатель/тумблер
    Name: DVIJ
    Flags: 
    **/
    DVIJ_10 = 10,

    /**
    ### Управление переходом
    Type: Выключатель/тумблер
    Name: up
    Flags: 
    **/
    up_11 = 11,

    /**
    ### управлеие холодильником
    Type: Выключатель/тумблер
    Name: uhol
    Flags: 
    **/
    uhol_12 = 12,

    /**
    ### Вентилятор 1
    Type: Выключатель/тумблер
    Name: v1
    Flags: 
    **/
    v1_13 = 13,

    /**
    ### Вентилятор 2
    Type: Выключатель/тумблер
    Name: v2
    Flags: 
    **/
    v2_14 = 14,

    /**
    ### Вентилятор 3
    Type: Выключатель/тумблер
    Name: v3
    Flags: 
    **/
    v3_15 = 15,

    /**
    ### Вентилятор 4
    Type: Выключатель/тумблер
    Name: v4
    Flags: 
    **/
    v4_16 = 16,

    /**
    ### Указатель повреждений:
    Type: Выключатель/тумблер
    Name: up1
    Flags: 
    **/
    up1_17 = 17,

    /**
    ### Указатель повреждений
    Type: Выключатель/тумблер
    Name: up2
    Flags: 
    **/
    up2_18 = 18,

    /**
    ### 1 ступень ослабления поля
    Type: Выключатель/тумблер
    Name: OP1
    Flags: 
    **/
    OP1_19 = 19,

    /**
    ### 2 ступень ослабления поля
    Type: Выключатель/тумблер
    Name: OP2
    Flags: 
    **/
    OP2_20 = 20,

    /**
    ### Боксование
    Type: Выключатель/тумблер
    Name: BOKS
    Flags: 
    **/
    BOKS_21 = 21,

    /**
    ### БФ передний левый
    Type: Мультипереключатель
    Name: bfpl
    Flags: CONTROLLERY
    **/
    bfpl_22 = 22,

    /**
    ### БФ передний правый
    Type: Мультипереключатель
    Name: bfpp
    Flags: CONTROLLERY
    **/
    bfpp_23 = 23,

    /**
    ### БФ задний левый
    Type: Мультипереключатель
    Name: bfzl
    Flags: CONTROLLERY
    **/
    bfzl_24 = 24,

    /**
    ### БФ задний правый
    Type: Мультипереключатель
    Name: bfzp
    Flags: CONTROLLERY
    **/
    bfzp_25 = 25,

    /**
    ### Прожектор ярко
    Type: Выключатель/тумблер
    Name: projjar
    Flags: 
    **/
    projjar_26 = 26,

    /**
    ### Прожектор тускло
    Type: Выключатель/тумблер
    Name: projtusc
    Flags: 
    **/
    projtusc_27 = 27,

    /**
    ### Освещение пульта
    Type: Мультипереключатель
    Name: ospult
    Flags: CONTROLLERY
    **/
    ospult_28 = 28,

    /**
    ### Зелёный свет
    Type: Выключатель/тумблер
    Name: zsvet
    Flags: 
    **/
    zsvet_29 = 29,

    /**
    ### Освещение кабины
    Type: Мультипереключатель
    Name: oscab
    Flags: CONTROLLERY
    **/
    oscab_30 = 30,

    /**
    ### Бдительность
    Type: Выключатель/тумблер
    Name: bditsec
    Flags: 
    **/
    bditsec_31 = 31,

    /**
    ### Фильтр АЛСН
    Type: Выключатель/тумблер
    Name: alsnN
    Flags: 
    **/
    alsnN_32 = 32,

    /**
    ### Пуск дизеля 1 секции
    Type: Кнопка
    Name: PD1
    Flags: NONFIXED
    **/
    PD1_33 = 33,

    /**
    ### Пуск дизеля 2 секции
    Type: Кнопка
    Name: PD2
    Flags: NONFIXED
    **/
    PD2_34 = 34,

    /**
    ### Аварийная остановка дизеля
    Type: Кнопка
    Name: avost
    Flags: NONFIXED
    **/
    avost_35 = 35,

    /**
    ### Пожар
    Type: Кнопка
    Name: JOPA
    Flags: NONFIXED
    **/
    JOPA_36 = 36,

    /**
    ### Поддержать разработчика
    Type: Кнопка
    Name: vizpom
    Flags: NONFIXED
    **/
    vizpom_37 = 37,

    /**
    ### Песок 1 ось
    Type: Кнопка
    Name: pesok1
    Flags: NONFIXED
    **/
    pesok1_38 = 38,

    /**
    ### Отпуск тормоза локомотива
    Type: Кнопка
    Name: OT
    Flags: NONFIXED
    **/
    OT_39 = 39,

    /**
    ### Сброс\установка КЖ
    Type: Кнопка
    Name: skj
    Flags: NONFIXED
    **/
    skj_40 = 40,

    /**
    ### Кнопка бдительности
    Type: Кнопка
    Name: rb
    Flags: NONFIXED
    **/
    rb_41 = 41,

    /**
    ### РБC
    Type: Кнопка
    Name: rbs
    Flags: NONFIXED
    **/
    rbs_42 = 42,

    /**
    ### Свисток/Тифон
    Type: Кнопка
    Name: tifs
    Flags: CONTROLLERY, NONFIXED
    **/
    tifs_43 = 43,

    /**
    ### Маневры
    Type: Кнопка
    Name: manev
    Flags: NONFIXED
    **/
    manev_44 = 44,

    /**
    ### ЭПК
    Type: Выключатель/тумблер
    Name: kepk
    Flags: 
    **/
    kepk_45 = 45,

    /**
    ### Песочница
    Type: Кнопка
    Name: pedpes
    Flags: NONFIXED
    **/
    pedpes_46 = 46,

    /**
    ### Ручной тормоз
    Type: Мультипереключатель
    Name: rt
    Flags: CONTROLLERX, PRECISE
    **/
    rt_47 = 47,

    /**
    ### АЗВ Управление общее
    Type: Выключатель/тумблер
    Name: UO
    Flags: 
    **/
    UO_48 = 48,

    /**
    ### АЗВ Калорифер
    Type: Выключатель/тумблер
    Name: KAL
    Flags: 
    **/
    KAL_49 = 49,

    /**
    ### АЗВ Возбудитель
    Type: Выключатель/тумблер
    Name: vozb
    Flags: 
    **/
    vozb_50 = 50,

    /**
    ### АЗВ Топливный насос
    Type: Выключатель/тумблер
    Name: tn
    Flags: 
    **/
    tn_51 = 51,

    /**
    ### АЗВ Дизель
    Type: Выключатель/тумблер
    Name: diz
    Flags: 
    **/
    diz_52 = 52,

    /**
    ### АЗВ Возбуждение
    Type: Выключатель/тумблер
    Name: uprvozb
    Flags: 
    **/
    uprvozb_53 = 53,

    /**
    ### АЗВ Компрессор
    Type: Выключатель/тумблер
    Name: kompr
    Flags: 
    **/
    kompr_54 = 54,

    /**
    ### АЗВ управления холодильниками
    Type: Выключатель/тумблер
    Name: uprhol
    Flags: 
    **/
    uprhol_55 = 55,

    /**
    ### АЗВ пожарная сигнализация
    Type: Выключатель/тумблер
    Name: pojsign
    Flags: 
    **/
    pojsign_56 = 56,

    /**
    ### АЗВ Прожектор
    Type: Выключатель/тумблер
    Name: proj
    Flags: 
    **/
    proj_57 = 57,

    /**
    ### АЗВ Радиостанция
    Type: Выключатель/тумблер
    Name: prs
    Flags: 
    **/
    prs_58 = 58,

    /**
    ### АЗВ Вентилятор кузова
    Type: Выключатель/тумблер
    Name: ventkuz
    Flags: 
    **/
    ventkuz_59 = 59,

    /**
    ### АЗВ АЛС
    Type: Выключатель/тумблер
    Name: alsn
    Flags: 
    **/
    alsn_60 = 60,

    /**
    ### АЗВ Вентилятор выпрямительной установки
    Type: Выключатель/тумблер
    Name: VVU
    Flags: 
    **/
    VVU_61 = 61,

    /**
    ### АЗВ питания блока управления возбуждением
    Type: Выключатель/тумблер
    Name: pitBUV
    Flags: 
    **/
    pitBUV_62 = 62,

    /**
    ### АЗВ ВУ
    Type: Выключатель/тумблер
    Name: AVU
    Flags: 
    **/
    AVU_63 = 63,

    /**
    ### Рубильник АБ
    Type: Выключатель/тумблер
    Name: AB
    Flags: 
    **/
    AB_64 = 64,

    /**
    ### ОМ-1
    Type: Выключатель/тумблер
    Name: om1
    Flags: 
    **/
    om1_65 = 65,

    /**
    ### ОМ-2
    Type: Выключатель/тумблер
    Name: om2
    Flags: 
    **/
    om2_66 = 66,

    /**
    ### ОМ-3
    Type: Выключатель/тумблер
    Name: om3
    Flags: 
    **/
    om3_67 = 67,

    /**
    ### ОМ-4
    Type: Выключатель/тумблер
    Name: om4
    Flags: 
    **/
    om4_68 = 68,

    /**
    ### ОМ-5
    Type: Выключатель/тумблер
    Name: om5
    Flags: 
    **/
    om5_69 = 69,

    /**
    ### ОМ-6
    Type: Выключатель/тумблер
    Name: om6
    Flags: 
    **/
    om6_70 = 70,

    /**
    ### Освещение тамбура
    Type: Выключатель/тумблер
    Name: osv
    Flags: 
    **/
    osv_71 = 71,

    /**
    ### Возбуждение генератора
    Type: Выключатель/тумблер
    Name: vozban
    Flags: 
    **/
    vozban_72 = 72,

    /**
    ### Подкузовное освещение
    Type: Выключатель/тумблер
    Name: ospod
    Flags: 
    **/
    ospod_73 = 73,

    /**
    ### Освещение дизельного помещения
    Type: Выключатель/тумблер
    Name: osdp
    Flags: 
    **/
    osdp_74 = 74,

    /**
    ### Освещение ВВК
    Type: Выключатель/тумблер
    Name: osvvk
    Flags: 
    **/
    osvvk_75 = 75,

    /**
    ### Автостоп
    Type: Выключатель/тумблер
    Name: epk
    Flags: 
    **/
    epk_76 = 76,

    /**
    ### АЗВ освещение
    Type: Выключатель/тумблер
    Name: AZVOS
    Flags: 
    **/
    AZVOS_77 = 77,

    /**
    ### Завод 3СЛ2М
    Type: Кнопка
    Name: SLZAVOD
    Flags: NONFIXED
    **/
    SLZAVOD_78 = 78,

    /**
    ### Завод 3СЛ2М.
    Type: Выключатель/тумблер
    Name: zavod1
    Flags: 
    **/
    zavod1_79 = 79,

    /**
    ### Освещение скоростемера
    Type: Выключатель/тумблер
    Name: osskor
    Flags: 
    **/
    osskor_80 = 80,

    /**
    ### тумблер К
    Type: Выключатель/тумблер
    Name: EpkK
    Flags: 
    **/
    EpkK_81 = 81,

    /**
    ### вызов ДСП
    Type: Кнопка
    Name: dsp
    Flags: NONFIXED
    **/
    dsp_82 = 82,

    /**
    ### вызов днц
    Type: Кнопка
    Name: DNC
    Flags: NONFIXED
    **/
    DNC_83 = 83,

    /**
    ### UNNAMED
    Type: Выключатель/тумблер
    Name: HOLH1
    Flags: 
    **/
    HOLH1_86 = 86,

    /**
    ### UNNAMED
    Type: Выключатель/тумблер
    Name: HOLH2
    Flags: 
    **/
    HOLH2_87 = 87,

  };
  
  /**
  ## Указатели.
  **/
  enum class disp : unsigned short {
    
    /**
    ### Скорость
    Type: ARROW
    Name: `speezdel`
        #### Values:
        MIN: `0.0`
        MAX: `41.7`
        ZERO: `14.45`
    **/
    speezdel_0 = 0,

    /**
    ### Питательная магистраль
    Type: ARROW
    Name: `DGR`
        #### Values:
        MIN: `0.0`
        MAX: `16.0`
        ZERO: `5.0`
    **/
    DGR_1 = 1,

    /**
    ### Тормозная магистраль
    Type: ARROW
    Name: `DTM`
        #### Values:
        MIN: `0.0`
        MAX: `16.0`
        ZERO: `5.0`
    **/
    DTM_2 = 2,

    /**
    ### Уравнительный резервуар
    Type: ARROW
    Name: `DURA`
        #### Values:
        MIN: `0.0`
        MAX: `10.0`
        ZERO: `2.0`
    **/
    DURA_3 = 3,

    /**
    ### Тормозной цилиндр 1
    Type: ARROW
    Name: `DTC1`
        #### Values:
        MIN: `0.0`
        MAX: `16.0`
        ZERO: `2.0`
    **/
    DTC1_4 = 4,

    /**
    ### Тормозной цилиндр 2
    Type: ARROW
    Name: `DTC2`
        #### Values:
        MIN: `0.0`
        MAX: `16.0`
        ZERO: `2.0`
    **/
    DTC2_5 = 5,

    /**
    ### Напряжение генератора
    Type: ARROW
    Name: `UGEN`
        #### Values:
        MIN: `0.0`
        MAX: `2.5`
        ZERO: `0.0`
    **/
    UGEN_6 = 6,

    /**
    ### Ток генератора
    Type: ARROW
    Name: `IGEN`
        #### Values:
        MIN: `0.0`
        MAX: `6.5`
        ZERO: `4.0`
    **/
    IGEN_7 = 7,

    /**
    ### Ток батареи
    Type: ARROW
    Name: `IAB`
        #### Values:
        MIN: `-150.0`
        MAX: `150.0`
        ZERO: `0.0`
    **/
    IAB_8 = 8,

    /**
    ### Давление масла 1 секции
    Type: ARROW
    Name: `DM1`
        #### Values:
        MIN: `0.0`
        MAX: `15.0`
        ZERO: `0.0`
    **/
    DM1_9 = 9,

    /**
    ### Давление масла 2 секции
    Type: ARROW
    Name: `DM2`
        #### Values:
        MIN: `0.0`
        MAX: `15.0`
        ZERO: `0.0`
    **/
    DM2_10 = 10,

    /**
    ### Температура воды 1
    Type: ARROW
    Name: `TV1`
        #### Values:
        MIN: `0.0`
        MAX: `120.0`
        ZERO: `60.0`
    **/
    TV1_11 = 11,

    /**
    ### Температура масла 1
    Type: ARROW
    Name: `TM1`
        #### Values:
        MIN: `0.0`
        MAX: `120.0`
        ZERO: `60.0`
    **/
    TM1_12 = 12,

    /**
    ### Температура воды 2
    Type: ARROW
    Name: `TV2`
        #### Values:
        MIN: `0.0`
        MAX: `120.0`
        ZERO: `60.0`
    **/
    TV2_13 = 13,

    /**
    ### Температура масла 2
    Type: ARROW
    Name: `TM2`
        #### Values:
        MIN: `0.0`
        MAX: `120.0`
        ZERO: `60.0`
    **/
    TM2_14 = 14,

    /**
    ### ПСС
    Type: LAMP
    Name: `pss`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    pss_15 = 15,

    /**
    ### Пожар
    Type: LAMP
    Name: `poj`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    poj_16 = 16,

    /**
    ### Сброс нагрузки 1
    Type: LAMP
    Name: `sn`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    sn_17 = 17,

    /**
    ### Сброс нагрузки 2
    Type: LAMP
    Name: `sn2`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    sn2_18 = 18,

    /**
    ### Охлаждение
    Type: LAMP
    Name: `ohla`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    ohla_19 = 19,

    /**
    ### Давление масла
    Type: LAMP
    Name: `dm`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    dm_20 = 20,

    /**
    ### Обрыв ТМ
    Type: LAMP
    Name: `dtm1`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    dtm1_21 = 21,

    /**
    ### Заторможено
    Type: LAMP
    Name: `torm`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    torm_22 = 22,

    /**
    ### Работа дизеля 2 секции
    Type: LAMP
    Name: `rzsd2`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    rzsd2_23 = 23,

    /**
    ### Температура воды
    Type: LAMP
    Name: `urvod`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    urvod_24 = 24,

    /**
    ### заземление
    Type: LAMP
    Name: `rz`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    rz_25 = 25,

    /**
    ### Скатывание
    Type: LAMP
    Name: `ppss`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    ppss_26 = 26,

    /**
    ### Давление топлива до фильтра ГО
    Type: ARROW
    Name: `DTDF`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DTDF_27 = 27,

    /**
    ### Давление топлива после фильтра ГО
    Type: ARROW
    Name: `DTPF`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DTPF_28 = 28,

    /**
    ### Давление масла до фильтра грубой очистки
    Type: ARROW
    Name: `DMDF`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DMDF_29 = 29,

    /**
    ### давление масла после фильтра грубой очистки
    Type: ARROW
    Name: `DMPF`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DMPF_30 = 30,

    /**
    ### давление масла после фильтра тонкой очистки
    Type: ARROW
    Name: `DMDFTO`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DMDFTO_31 = 31,

    /**
    ### Давление наддуовчного воздуха
    Type: ARROW
    Name: `DNTK`
        #### Values:
        MIN: `0.0`
        MAX: `16.5`
        ZERO: `2.0`
    **/
    DNTK_32 = 32,

    /**
    ### напряжение батареи
    Type: ARROW
    Name: `UAB`
        #### Values:
        MIN: `0.0`
        MAX: `150.0`
        ZERO: `0.0`
    **/
    UAB_34 = 34,

    /**
    ### Часы
    Type: ARROW
    Name: `chas`
        #### Values:
        MIN: `0.0`
        MAX: `24.00`
        ZERO: `0.0`
    **/
    chas_35 = 35,

    /**
    ### Минуты
    Type: ARROW
    Name: `minut`
        #### Values:
        MIN: `0.0`
        MAX: `60.00`
        ZERO: `0.0`
    **/
    minut_36 = 36,

    /**
    ### подсветка приборов
    Type: LAMP
    Name: `podsvetka`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    podsvetka_33 = 33,

    /**
    ### скоростемер день
    Type: LAMP
    Name: `sl2m-1`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    sl2m_1_37 = 37,

    /**
    ### скоростемер ночь
    Type: LAMP
    Name: `sl2msvet`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    sl2msvet_38 = 38,

    /**
    ### плафоны выкл
    Type: LAMP
    Name: `Plafony`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    Plafony_39 = 39,

    /**
    ### плафоны вкл
    Type: LAMP
    Name: `PlafonySV`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    PlafonySV_40 = 40,

    /**
    ### плафоны зелёный свет
    Type: LAMP
    Name: `plafzel`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    plafzel_41 = 41,

    /**
    ### плафоны свет тамбур
    Type: LAMP
    Name: `LT`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    LT_42 = 42,

    /**
    ### плафоны свет машинное
    Type: LAMP
    Name: `ML`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    ML_43 = 43,

    /**
    ### подсветка завода часов
    Type: LAMP
    Name: `SLZAVODSVET`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    SLZAVODSVET_44 = 44,

    /**
    ### подсветка завода часов 2
    Type: LAMP
    Name: `zavodsvet`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    zavodsvet_45 = 45,

    /**
    ### посветка стрелки минутной
    Type: LAMP
    Name: `minutSVET`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    minutSVET_46 = 46,

    /**
    ### посветка стрелки часовой
    Type: LAMP
    Name: `chasSVET`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    chasSVET_47 = 47,

    /**
    ### посветка стрелки скоростемера
    Type: LAMP
    Name: `speezdeSVET`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    speezdeSVET_48 = 48,

    /**
    ### табло РСТ
    Type: LAMP
    Name: `rsttablo`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    rsttablo_49 = 49,

    /**
    ### плафоны яркое вкл
    Type: LAMP
    Name: `PlafonySVY`
        #### Values:
        `0` - OFF
        `1` - ON
    **/
    PlafonySVY_50 = 50,

    /**
    ### Указатель повреждений
    Type: ARROW
    Name: `UUKPOV`
        #### Values:
        MIN: `0.0`
        MAX: `1.0`
        ZERO: `0.0`
    **/
    UUKPOV_51 = 51,

  };
  
  /**
  ## Состояния приборов
  **/
  namespace st {
    
    /**
    #### Состояния переключателя
    ### Контроллер машиниста
    Name: `kontrol`
    Default: `0`
    States:
    - `0` - [0]
    - `1` - [1]
    - `2` - [2]
    - `3` - [3]
    - `4` - [4]
    - `5` - [5]
    - `6` - [6]
    - `7` - [7]
    - `8` - [8]
    - `9` - [9]
    - `10` - [10]
    - `11` - [11]
    - `12` - [12]
    - `13` - [13]
    - `14` - [14]
    - `15` - [15]
    **/
    enum class kontrol : unsigned short {
      /**
      #### Контроллер машиниста
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Контроллер машиниста
      ### [0]
      **/
      ST_0 = 0,

      /**
      #### Контроллер машиниста
      ### [1]
      **/
      ST_1 = 1,

      /**
      #### Контроллер машиниста
      ### [2]
      **/
      ST_2 = 2,

      /**
      #### Контроллер машиниста
      ### [3]
      **/
      ST_3 = 3,

      /**
      #### Контроллер машиниста
      ### [4]
      **/
      ST_4 = 4,

      /**
      #### Контроллер машиниста
      ### [5]
      **/
      ST_5 = 5,

      /**
      #### Контроллер машиниста
      ### [6]
      **/
      ST_6 = 6,

      /**
      #### Контроллер машиниста
      ### [7]
      **/
      ST_7 = 7,

      /**
      #### Контроллер машиниста
      ### [8]
      **/
      ST_8 = 8,

      /**
      #### Контроллер машиниста
      ### [9]
      **/
      ST_9 = 9,

      /**
      #### Контроллер машиниста
      ### [10]
      **/
      ST_10 = 10,

      /**
      #### Контроллер машиниста
      ### [11]
      **/
      ST_11 = 11,

      /**
      #### Контроллер машиниста
      ### [12]
      **/
      ST_12 = 12,

      /**
      #### Контроллер машиниста
      ### [13]
      **/
      ST_13 = 13,

      /**
      #### Контроллер машиниста
      ### [14]
      **/
      ST_14 = 14,

      /**
      #### Контроллер машиниста
      ### [15]
      **/
      ST_15 = 15,
    };
  
    /**
    #### Состояния переключателя
    ### Реверсивная рукоятка
    Name: `revers`
    Default: `1`
    States:
    - `0` - [Назад]
    - `1` - [0]
    - `2` - [Вперед]
    **/
    enum class revers : unsigned short {
      /**
      #### Реверсивная рукоятка
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Реверсивная рукоятка
      ### [Назад]
      **/
      ST_0 = 0,

      /**
      #### Реверсивная рукоятка
      ### [0]
      **/
      ST_1 = 1,

      /**
      #### Реверсивная рукоятка
      ### [Вперед]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Редуктор зарядного давления ТМ
    Name: `reduk`
    Default: `13`
    States:
    - `0` - [3.9]
    - `1` - [4.0]
    - `2` - [4.1]
    - `3` - [4.2]
    - `4` - [4.3]
    - `5` - [4.4]
    - `6` - [4.5]
    - `7` - [4.6]
    - `8` - [4.7]
    - `9` - [4.8]
    - `10` - [4.9]
    - `11` - [5.0]
    - `12` - [5.1]
    - `13` - [5.2]
    - `14` - [5.3]
    - `15` - [5.4]
    - `16` - [5.5]
    - `17` - [5.6]
    - `18` - [5.7]
    - `19` - [5.8]
    **/
    enum class reduk : unsigned short {
      /**
      #### Редуктор зарядного давления ТМ
      ### Исходное состояние
      **/
      DEFAULT = 13,

      /**
      #### Редуктор зарядного давления ТМ
      ### [3.9]
      **/
      ST_0 = 0,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.0]
      **/
      ST_1 = 1,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.1]
      **/
      ST_2 = 2,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.2]
      **/
      ST_3 = 3,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.3]
      **/
      ST_4 = 4,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.4]
      **/
      ST_5 = 5,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.5]
      **/
      ST_6 = 6,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.6]
      **/
      ST_7 = 7,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.7]
      **/
      ST_8 = 8,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.8]
      **/
      ST_9 = 9,

      /**
      #### Редуктор зарядного давления ТМ
      ### [4.9]
      **/
      ST_10 = 10,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.0]
      **/
      ST_11 = 11,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.1]
      **/
      ST_12 = 12,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.2]
      **/
      ST_13 = 13,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.3]
      **/
      ST_14 = 14,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.4]
      **/
      ST_15 = 15,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.5]
      **/
      ST_16 = 16,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.6]
      **/
      ST_17 = 17,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.7]
      **/
      ST_18 = 18,

      /**
      #### Редуктор зарядного давления ТМ
      ### [5.8]
      **/
      ST_19 = 19,
    };
  
    /**
    #### Состояния переключателя
    ### Комбинированный кран
    Name: `kdt`
    Default: `1`
    States:
    - `0` - [Двойная тяга]
    - `1` - [поездное]
    - `2` - [Экстренное торможение]
    **/
    enum class kdt : unsigned short {
      /**
      #### Комбинированный кран
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Комбинированный кран
      ### [Двойная тяга]
      **/
      ST_0 = 0,

      /**
      #### Комбинированный кран
      ### [поездное]
      **/
      ST_1 = 1,

      /**
      #### Комбинированный кран
      ### [Экстренное торможение]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Ключ БУ 367
    Name: `block`
    Default: `0`
    States:
    - `0` - [выкл]
    - `1` - [вкл]
    **/
    enum class block : unsigned short {
      /**
      #### Ключ БУ 367
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Ключ БУ 367
      ### [выкл]
      **/
      ST_0 = 0,

      /**
      #### Ключ БУ 367
      ### [вкл]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Тормоз локомотива усл. 254
    Name: ``
    Default: `0`
    States:
    - `0` - [4]
    - `1` - [3]
    - `2` - [2]
    - `3` - [1]
    - `4` - [Поездное]
    - `5` - [Буфер - не работает. ЖМИ КНОПКУ!]
    **/
    enum class _254 : unsigned short {
      /**
      #### Тормоз локомотива усл. 254
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Тормоз локомотива усл. 254
      ### [4]
      **/
      ST_0 = 0,

      /**
      #### Тормоз локомотива усл. 254
      ### [3]
      **/
      ST_1 = 1,

      /**
      #### Тормоз локомотива усл. 254
      ### [2]
      **/
      ST_2 = 2,

      /**
      #### Тормоз локомотива усл. 254
      ### [1]
      **/
      ST_3 = 3,

      /**
      #### Тормоз локомотива усл. 254
      ### [Поездное]
      **/
      ST_4 = 4,

      /**
      #### Тормоз локомотива усл. 254
      ### [Буфер - не работает. ЖМИ КНОПКУ!]
      **/
      ST_5 = 5,
    };
  
    /**
    #### Состояния переключателя
    ### Тормоз поезда усл. 394
    Name: ``
    Default: `0`
    States:
    - `0` - [VI Экстренное торможение]
    - `1` - [V Служебное торможение]
    - `2` - [Va Торможение замедленным темпом]
    - `3` - [IV Перекрыша с питанием]
    - `4` - [III Перекрыша без питания]
    - `5` - [II Поездное]
    - `6` - [I Отпуск и зарядка]
    **/
    enum class _394 : unsigned short {
      /**
      #### Тормоз поезда усл. 394
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Тормоз поезда усл. 394
      ### [VI Экстренное торможение]
      **/
      ST_0 = 0,

      /**
      #### Тормоз поезда усл. 394
      ### [V Служебное торможение]
      **/
      ST_1 = 1,

      /**
      #### Тормоз поезда усл. 394
      ### [Va Торможение замедленным темпом]
      **/
      ST_2 = 2,

      /**
      #### Тормоз поезда усл. 394
      ### [IV Перекрыша с питанием]
      **/
      ST_3 = 3,

      /**
      #### Тормоз поезда усл. 394
      ### [III Перекрыша без питания]
      **/
      ST_4 = 4,

      /**
      #### Тормоз поезда усл. 394
      ### [II Поездное]
      **/
      ST_5 = 5,

      /**
      #### Тормоз поезда усл. 394
      ### [I Отпуск и зарядка]
      **/
      ST_6 = 6,
    };
  
    /**
    #### Состояния переключателя
    ### Топливный насос 1
    Name: `tn1`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class tn1 : unsigned short {
      /**
      #### Топливный насос 1
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Топливный насос 1
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Топливный насос 1
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Топливный насос 2
    Name: `tn2`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class tn2 : unsigned short {
      /**
      #### Топливный насос 2
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Топливный насос 2
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Топливный насос 2
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Управление тепловозом
    Name: `ut`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class ut : unsigned short {
      /**
      #### Управление тепловозом
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Управление тепловозом
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Управление тепловозом
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Движение
    Name: `DVIJ`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class DVIJ : unsigned short {
      /**
      #### Движение
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Движение
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Движение
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Управление переходом
    Name: `up`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class up : unsigned short {
      /**
      #### Управление переходом
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Управление переходом
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Управление переходом
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### управлеие холодильником
    Name: `uhol`
    Default: `1`
    States:
    - `0` - [Ручное]
    - `1` - [Автомат]
    **/
    enum class uhol : unsigned short {
      /**
      #### управлеие холодильником
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### управлеие холодильником
      ### [Ручное]
      **/
      ST_0 = 0,

      /**
      #### управлеие холодильником
      ### [Автомат]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Вентилятор 1
    Name: `v1`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class v1 : unsigned short {
      /**
      #### Вентилятор 1
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Вентилятор 1
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Вентилятор 1
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Вентилятор 2
    Name: `v2`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class v2 : unsigned short {
      /**
      #### Вентилятор 2
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Вентилятор 2
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Вентилятор 2
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Вентилятор 3
    Name: `v3`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class v3 : unsigned short {
      /**
      #### Вентилятор 3
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Вентилятор 3
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Вентилятор 3
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Вентилятор 4
    Name: `v4`
    Default: `0`
    States:
    - `0` - [выкл]
    - `1` - [вкл]
    **/
    enum class v4 : unsigned short {
      /**
      #### Вентилятор 4
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Вентилятор 4
      ### [выкл]
      **/
      ST_0 = 0,

      /**
      #### Вентилятор 4
      ### [вкл]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Указатель повреждений:
    Name: `up1`
    Default: `1`
    States:
    - `0` - [2 Секция]
    - `1` - [1 Секция]
    **/
    enum class up1 : unsigned short {
      /**
      #### Указатель повреждений:
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Указатель повреждений:
      ### [2 Секция]
      **/
      ST_0 = 0,

      /**
      #### Указатель повреждений:
      ### [1 Секция]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Указатель повреждений
    Name: `up2`
    Default: `0`
    States:
    - `0` - [выкл.]
    - `1` - [вкл.]
    **/
    enum class up2 : unsigned short {
      /**
      #### Указатель повреждений
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Указатель повреждений
      ### [выкл.]
      **/
      ST_0 = 0,

      /**
      #### Указатель повреждений
      ### [вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### 1 ступень ослабления поля
    Name: `OP1`
    Default: `0`
    States:
    - `0` - [Автомат]
    - `1` - [Вкл.]
    **/
    enum class OP1 : unsigned short {
      /**
      #### 1 ступень ослабления поля
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### 1 ступень ослабления поля
      ### [Автомат]
      **/
      ST_0 = 0,

      /**
      #### 1 ступень ослабления поля
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### 2 ступень ослабления поля
    Name: `OP2`
    Default: `0`
    States:
    - `0` - [Автомат]
    - `1` - [вкл.]
    **/
    enum class OP2 : unsigned short {
      /**
      #### 2 ступень ослабления поля
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### 2 ступень ослабления поля
      ### [Автомат]
      **/
      ST_0 = 0,

      /**
      #### 2 ступень ослабления поля
      ### [вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Боксование
    Name: `BOKS`
    Default: `0`
    States:
    - `0` - [выкл.]
    - `1` - [вкл.]
    **/
    enum class BOKS : unsigned short {
      /**
      #### Боксование
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Боксование
      ### [выкл.]
      **/
      ST_0 = 0,

      /**
      #### Боксование
      ### [вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### БФ передний левый
    Name: `bfpl`
    Default: `1`
    States:
    - `0` - [белый]
    - `1` - [выкл.]
    - `2` - [красный]
    **/
    enum class bfpl : unsigned short {
      /**
      #### БФ передний левый
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### БФ передний левый
      ### [белый]
      **/
      ST_0 = 0,

      /**
      #### БФ передний левый
      ### [выкл.]
      **/
      ST_1 = 1,

      /**
      #### БФ передний левый
      ### [красный]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### БФ передний правый
    Name: `bfpp`
    Default: `1`
    States:
    - `0` - [белый]
    - `1` - [выкл.]
    - `2` - [красный]
    **/
    enum class bfpp : unsigned short {
      /**
      #### БФ передний правый
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### БФ передний правый
      ### [белый]
      **/
      ST_0 = 0,

      /**
      #### БФ передний правый
      ### [выкл.]
      **/
      ST_1 = 1,

      /**
      #### БФ передний правый
      ### [красный]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### БФ задний левый
    Name: `bfzl`
    Default: `1`
    States:
    - `0` - [белый]
    - `1` - [выкл.]
    - `2` - [красный]
    **/
    enum class bfzl : unsigned short {
      /**
      #### БФ задний левый
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### БФ задний левый
      ### [белый]
      **/
      ST_0 = 0,

      /**
      #### БФ задний левый
      ### [выкл.]
      **/
      ST_1 = 1,

      /**
      #### БФ задний левый
      ### [красный]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### БФ задний правый
    Name: `bfzp`
    Default: `1`
    States:
    - `0` - [белый]
    - `1` - [выкл.]
    - `2` - [красный]
    **/
    enum class bfzp : unsigned short {
      /**
      #### БФ задний правый
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### БФ задний правый
      ### [белый]
      **/
      ST_0 = 0,

      /**
      #### БФ задний правый
      ### [выкл.]
      **/
      ST_1 = 1,

      /**
      #### БФ задний правый
      ### [красный]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Прожектор ярко
    Name: `projjar`
    Default: `0`
    States:
    - `0` - [выкл]
    - `1` - [вкл]
    **/
    enum class projjar : unsigned short {
      /**
      #### Прожектор ярко
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Прожектор ярко
      ### [выкл]
      **/
      ST_0 = 0,

      /**
      #### Прожектор ярко
      ### [вкл]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Прожектор тускло
    Name: `projtusc`
    Default: `0`
    States:
    - `0` - [выкл]
    - `1` - [вкл]
    **/
    enum class projtusc : unsigned short {
      /**
      #### Прожектор тускло
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Прожектор тускло
      ### [выкл]
      **/
      ST_0 = 0,

      /**
      #### Прожектор тускло
      ### [вкл]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение пульта
    Name: `ospult`
    Default: `1`
    States:
    - `0` - [Тусклое]
    - `1` - [Выкл.]
    - `2` - [Яркое]
    **/
    enum class ospult : unsigned short {
      /**
      #### Освещение пульта
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Освещение пульта
      ### [Тусклое]
      **/
      ST_0 = 0,

      /**
      #### Освещение пульта
      ### [Выкл.]
      **/
      ST_1 = 1,

      /**
      #### Освещение пульта
      ### [Яркое]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Зелёный свет
    Name: `zsvet`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [вкл.]
    **/
    enum class zsvet : unsigned short {
      /**
      #### Зелёный свет
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Зелёный свет
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Зелёный свет
      ### [вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение кабины
    Name: `oscab`
    Default: `1`
    States:
    - `0` - [Тусклое]
    - `1` - [Выкл.]
    - `2` - [Яркое]
    **/
    enum class oscab : unsigned short {
      /**
      #### Освещение кабины
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Освещение кабины
      ### [Тусклое]
      **/
      ST_0 = 0,

      /**
      #### Освещение кабины
      ### [Выкл.]
      **/
      ST_1 = 1,

      /**
      #### Освещение кабины
      ### [Яркое]
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Бдительность
    Name: `bditsec`
    Default: `0`
    States:
    - `0` - [60-90]
    - `1` - [30-40]
    **/
    enum class bditsec : unsigned short {
      /**
      #### Бдительность
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Бдительность
      ### [60-90]
      **/
      ST_0 = 0,

      /**
      #### Бдительность
      ### [30-40]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Фильтр АЛСН
    Name: `alsnN`
    Default: `0`
    States:
    - `0` - [25]
    - `1` - [50]
    **/
    enum class alsnN : unsigned short {
      /**
      #### Фильтр АЛСН
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Фильтр АЛСН
      ### [25]
      **/
      ST_0 = 0,

      /**
      #### Фильтр АЛСН
      ### [50]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Пуск дизеля 1 секции
    Name: `PD1`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class PD1 : unsigned short {
      /**
      #### Пуск дизеля 1 секции
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Пуск дизеля 1 секции
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Пуск дизеля 1 секции
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Пуск дизеля 2 секции
    Name: `PD2`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class PD2 : unsigned short {
      /**
      #### Пуск дизеля 2 секции
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Пуск дизеля 2 секции
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Пуск дизеля 2 секции
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Аварийная остановка дизеля
    Name: `avost`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class avost : unsigned short {
      /**
      #### Аварийная остановка дизеля
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Аварийная остановка дизеля
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Аварийная остановка дизеля
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Пожар
    Name: `JOPA`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class JOPA : unsigned short {
      /**
      #### Пожар
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Пожар
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Пожар
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Поддержать разработчика
    Name: `vizpom`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class vizpom : unsigned short {
      /**
      #### Поддержать разработчика
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Поддержать разработчика
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Поддержать разработчика
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Песок 1 ось
    Name: `pesok1`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class pesok1 : unsigned short {
      /**
      #### Песок 1 ось
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Песок 1 ось
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Песок 1 ось
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Отпуск тормоза локомотива
    Name: `OT`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class OT : unsigned short {
      /**
      #### Отпуск тормоза локомотива
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Отпуск тормоза локомотива
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Отпуск тормоза локомотива
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Сброс\установка КЖ
    Name: `skj`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class skj : unsigned short {
      /**
      #### Сброс\установка КЖ
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Сброс\установка КЖ
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Сброс\установка КЖ
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Кнопка бдительности
    Name: `rb`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class rb : unsigned short {
      /**
      #### Кнопка бдительности
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Кнопка бдительности
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Кнопка бдительности
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### РБC
    Name: `rbs`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class rbs : unsigned short {
      /**
      #### РБC
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### РБC
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### РБC
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Свисток/Тифон
    Name: `tifs`
    Default: `1`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    - `2` - UNNAMED
    **/
    enum class tifs : unsigned short {
      /**
      #### Свисток/Тифон
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Свисток/Тифон
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Свисток/Тифон
      ### UNNAMED
      **/
      ST_1 = 1,

      /**
      #### Свисток/Тифон
      ### UNNAMED
      **/
      ST_2 = 2,
    };
  
    /**
    #### Состояния переключателя
    ### Маневры
    Name: `manev`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class manev : unsigned short {
      /**
      #### Маневры
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Маневры
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Маневры
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ЭПК
    Name: `kepk`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class kepk : unsigned short {
      /**
      #### ЭПК
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ЭПК
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ЭПК
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Песочница
    Name: `pedpes`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class pedpes : unsigned short {
      /**
      #### Песочница
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Песочница
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Песочница
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Ручной тормоз
    Name: `rt`
    Default: `4`
    States:
    - `0` - [Отпущен]
    - `1` - [25%]
    - `2` - [50%]
    - `3` - [75%]
    - `4` - [100%]
    **/
    enum class rt : unsigned short {
      /**
      #### Ручной тормоз
      ### Исходное состояние
      **/
      DEFAULT = 4,

      /**
      #### Ручной тормоз
      ### [Отпущен]
      **/
      ST_0 = 0,

      /**
      #### Ручной тормоз
      ### [25%]
      **/
      ST_1 = 1,

      /**
      #### Ручной тормоз
      ### [50%]
      **/
      ST_2 = 2,

      /**
      #### Ручной тормоз
      ### [75%]
      **/
      ST_3 = 3,

      /**
      #### Ручной тормоз
      ### [100%]
      **/
      ST_4 = 4,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Управление общее
    Name: `UO`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class UO : unsigned short {
      /**
      #### АЗВ Управление общее
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Управление общее
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Управление общее
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Калорифер
    Name: `KAL`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class KAL : unsigned short {
      /**
      #### АЗВ Калорифер
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Калорифер
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Калорифер
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Возбудитель
    Name: `vozb`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class vozb : unsigned short {
      /**
      #### АЗВ Возбудитель
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Возбудитель
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Возбудитель
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Топливный насос
    Name: `tn`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class tn : unsigned short {
      /**
      #### АЗВ Топливный насос
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Топливный насос
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Топливный насос
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Дизель
    Name: `diz`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class diz : unsigned short {
      /**
      #### АЗВ Дизель
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Дизель
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Дизель
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Возбуждение
    Name: `uprvozb`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class uprvozb : unsigned short {
      /**
      #### АЗВ Возбуждение
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Возбуждение
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Возбуждение
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Компрессор
    Name: `kompr`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class kompr : unsigned short {
      /**
      #### АЗВ Компрессор
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Компрессор
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Компрессор
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ управления холодильниками
    Name: `uprhol`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class uprhol : unsigned short {
      /**
      #### АЗВ управления холодильниками
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ управления холодильниками
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ управления холодильниками
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ пожарная сигнализация
    Name: `pojsign`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class pojsign : unsigned short {
      /**
      #### АЗВ пожарная сигнализация
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ пожарная сигнализация
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ пожарная сигнализация
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Прожектор
    Name: `proj`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class proj : unsigned short {
      /**
      #### АЗВ Прожектор
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Прожектор
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Прожектор
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Радиостанция
    Name: `prs`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class prs : unsigned short {
      /**
      #### АЗВ Радиостанция
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Радиостанция
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Радиостанция
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Вентилятор кузова
    Name: `ventkuz`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class ventkuz : unsigned short {
      /**
      #### АЗВ Вентилятор кузова
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Вентилятор кузова
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Вентилятор кузова
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ АЛС
    Name: `alsn`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class alsn : unsigned short {
      /**
      #### АЗВ АЛС
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ АЛС
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ АЛС
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ Вентилятор выпрямительной установки
    Name: `VVU`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class VVU : unsigned short {
      /**
      #### АЗВ Вентилятор выпрямительной установки
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ Вентилятор выпрямительной установки
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ Вентилятор выпрямительной установки
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ питания блока управления возбуждением
    Name: `pitBUV`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class pitBUV : unsigned short {
      /**
      #### АЗВ питания блока управления возбуждением
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ питания блока управления возбуждением
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ питания блока управления возбуждением
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ ВУ
    Name: `AVU`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class AVU : unsigned short {
      /**
      #### АЗВ ВУ
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ ВУ
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ ВУ
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Рубильник АБ
    Name: `AB`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class AB : unsigned short {
      /**
      #### Рубильник АБ
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Рубильник АБ
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Рубильник АБ
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-1
    Name: `om1`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om1 : unsigned short {
      /**
      #### ОМ-1
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-1
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-1
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-2
    Name: `om2`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om2 : unsigned short {
      /**
      #### ОМ-2
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-2
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-2
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-3
    Name: `om3`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om3 : unsigned short {
      /**
      #### ОМ-3
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-3
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-3
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-4
    Name: `om4`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om4 : unsigned short {
      /**
      #### ОМ-4
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-4
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-4
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-5
    Name: `om5`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om5 : unsigned short {
      /**
      #### ОМ-5
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-5
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-5
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### ОМ-6
    Name: `om6`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class om6 : unsigned short {
      /**
      #### ОМ-6
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### ОМ-6
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### ОМ-6
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение тамбура
    Name: `osv`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class osv : unsigned short {
      /**
      #### Освещение тамбура
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Освещение тамбура
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Освещение тамбура
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Возбуждение генератора
    Name: `vozban`
    Default: `1`
    States:
    - `0` - [Аварийное]
    - `1` - [Нормальное]
    **/
    enum class vozban : unsigned short {
      /**
      #### Возбуждение генератора
      ### Исходное состояние
      **/
      DEFAULT = 1,

      /**
      #### Возбуждение генератора
      ### [Аварийное]
      **/
      ST_0 = 0,

      /**
      #### Возбуждение генератора
      ### [Нормальное]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Подкузовное освещение
    Name: `ospod`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class ospod : unsigned short {
      /**
      #### Подкузовное освещение
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Подкузовное освещение
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Подкузовное освещение
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение дизельного помещения
    Name: `osdp`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class osdp : unsigned short {
      /**
      #### Освещение дизельного помещения
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Освещение дизельного помещения
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Освещение дизельного помещения
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение ВВК
    Name: `osvvk`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class osvvk : unsigned short {
      /**
      #### Освещение ВВК
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Освещение ВВК
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Освещение ВВК
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Автостоп
    Name: `epk`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class epk : unsigned short {
      /**
      #### Автостоп
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Автостоп
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Автостоп
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### АЗВ освещение
    Name: `AZVOS`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class AZVOS : unsigned short {
      /**
      #### АЗВ освещение
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### АЗВ освещение
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### АЗВ освещение
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Завод 3СЛ2М
    Name: `SLZAVOD`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    - `2` - UNNAMED
    - `3` - UNNAMED
    - `4` - UNNAMED
    **/
    enum class SLZAVOD : unsigned short {
      /**
      #### Завод 3СЛ2М
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Завод 3СЛ2М
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Завод 3СЛ2М
      ### UNNAMED
      **/
      ST_1 = 1,

      /**
      #### Завод 3СЛ2М
      ### UNNAMED
      **/
      ST_2 = 2,

      /**
      #### Завод 3СЛ2М
      ### UNNAMED
      **/
      ST_3 = 3,

      /**
      #### Завод 3СЛ2М
      ### UNNAMED
      **/
      ST_4 = 4,
    };
  
    /**
    #### Состояния переключателя
    ### Завод 3СЛ2М.
    Name: `zavod1`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class zavod1 : unsigned short {
      /**
      #### Завод 3СЛ2М.
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Завод 3СЛ2М.
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### Завод 3СЛ2М.
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### Освещение скоростемера
    Name: `osskor`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class osskor : unsigned short {
      /**
      #### Освещение скоростемера
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### Освещение скоростемера
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### Освещение скоростемера
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### тумблер К
    Name: `EpkK`
    Default: `0`
    States:
    - `0` - [Выкл.]
    - `1` - [Вкл.]
    **/
    enum class EpkK : unsigned short {
      /**
      #### тумблер К
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### тумблер К
      ### [Выкл.]
      **/
      ST_0 = 0,

      /**
      #### тумблер К
      ### [Вкл.]
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### вызов ДСП
    Name: `dsp`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class dsp : unsigned short {
      /**
      #### вызов ДСП
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### вызов ДСП
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### вызов ДСП
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### вызов днц
    Name: `DNC`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class DNC : unsigned short {
      /**
      #### вызов днц
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### вызов днц
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### вызов днц
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### UNNAMED
    Name: `HOLH1`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class HOLH1 : unsigned short {
      /**
      #### UNNAMED
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### UNNAMED
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### UNNAMED
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
    /**
    #### Состояния переключателя
    ### UNNAMED
    Name: `HOLH2`
    Default: `0`
    States:
    - `0` - UNNAMED
    - `1` - UNNAMED
    **/
    enum class HOLH2 : unsigned short {
      /**
      #### UNNAMED
      ### Исходное состояние
      **/
      DEFAULT = 0,

      /**
      #### UNNAMED
      ### UNNAMED
      **/
      ST_0 = 0,

      /**
      #### UNNAMED
      ### UNNAMED
      **/
      ST_1 = 1,
    };
  
  };
  



  /**
    ## Источники света
   **/
  enum class lights : unsigned short {
    
    /**
    #### Источник света
    ### UNNAMED
    **/
    _0 = 0,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _1 = 1,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _2 = 2,

    /**
    #### Источник света
    ### LampP1
    **/
    LampP1_3 = 3,

    /**
    #### Источник света
    ### LampP2
    **/
    LampP2_4 = 4,

    /**
    #### Источник света
    ### LampP3
    **/
    LampP3_5 = 5,

    /**
    #### Источник света
    ### LampP4
    **/
    LampP4_6 = 6,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _7 = 7,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _8 = 8,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _9 = 9,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _10 = 10,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _11 = 11,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _12 = 12,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _13 = 13,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _14 = 14,

    /**
    #### Источник света
    ### UNNAMED
    **/
    _15 = 15,

  };

  /**
    ## Анимации
   **/
  enum class anims : unsigned short {
  
  };
};

  